# Congestion Charging - Easy

![rel](https://sqlzoo.net/w/images/f/f6/CongestionCharge.png)

camera(**id**, perim)

keeper(**id**, name, address)

vehicle(**id**, keeper)

image(**_camera_**, **whn**, reg)

permit(**_reg_**, **sDate**, chargeType)

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

## Sample query

List the vehicles for which 'Strenuous, Sam' is the registered keeper. The link between Keepers and Vehicles is via the foreign key specified in the CREATE TABLE vehicle statement. Note the line:

```
 ,FOREIGN KEY(keeper) REFERENCES keeper(id)
```

This will be the basis of our join condition.

## 1.
Show the name and address of the keeper of vehicle SO 02 PSP.

In [2]:
%%sql
SELECT name, address FROM
  keeper JOIN vehicle ON (keeper.id=vehicle.keeper)
    WHERE vehicle.id='SO 02 PSP'

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('Strenuous, Sam', 'Surjection Street')]

## 2.
Show the number of cameras that take images for incoming vehicles.

In [3]:
%%sql
SELECT COUNT(*) n FROM camera
  WHERE perim='IN'

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[(8,)]

## 3.
List the image details taken by Camera 10 before 26 Feb 2007.

In [4]:
%%sql
SELECT image.* FROM
  image JOIN camera ON (image.camera=camera.id)
    WHERE whn < '2007-02-26'

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[(1, '2007-02-25 06:10:13.0', 'SO 02 ASP'),
 (9, '2007-02-25 06:26:04.0', 'SO 02 ASP'),
 (17, '2007-02-25 06:20:01.0', 'SO 02 ASP'),
 (18, '2007-02-25 06:23:40.0', 'SO 02 ASP'),
 (8, '2007-02-25 07:35:41.0', 'SO 02 CSP'),
 (8, '2007-02-25 07:48:10.0', 'SO 02 CSP'),
 (10, '2007-02-25 07:45:11.0', 'SO 02 CSP'),
 (11, '2007-02-25 07:58:01.0', 'SO 02 CSP'),
 (12, '2007-02-25 07:04:31.0', 'SO 02 CSP'),
 (17, '2007-02-25 06:57:31.0', 'SO 02 CSP'),
 (17, '2007-02-25 07:00:40.0', 'SO 02 CSP'),
 (18, '2007-02-25 07:39:04.0', 'SO 02 CSP'),
 (18, '2007-02-25 07:42:30.0', 'SO 02 CSP'),
 (18, '2007-02-25 07:55:11.0', 'SO 02 CSP'),
 (19, '2007-02-25 07:51:10.0', 'SO 02 CSP'),
 (9, '2007-02-25 18:54:30.0', 'SO 02 DSP'),
 (18, '2007-02-25 16:29:11.0', 'SO 02 DSP'),
 (19, '2007-02-25 16:31:01.0', 'SO 02 DSP'),
 (19, '2007-02-25 17:42:41.0', 'SO 02 DSP'),
 (3, '2007-02-25 17:16:11.0', 'SO 02 ESP'),
 (10, '2007-02-25 18:08:40.0', 'SO 02 ESP'),
 (11, '2007-02-25 18:08:00.0', 'SO 02 FSP'),
 (5, '2007-02-25 07:10:00.0', 'SO 02 GSP'),
 (12, '2007-02-25 18:08:13.0', 'SO 02 GSP'),
 (16, '2007-02-25 07:13:00.0', 'SO 02 GSP'),
 (9, '2007-02-25 16:45:04.0', 'SO 02 HSP'),
 (9, '2007-02-25 16:48:11.0', 'SO 02 HSP'),
 (9, '2007-02-25 16:51:30.0', 'SO 02 HSP'),
 (9, '2007-02-25 16:58:01.0', 'SO 02 ISP'),
 (12, '2007-02-25 17:01:13.0', 'SO 02 ISP'),
 (3, '2007-02-25 17:07:00.0', 'SO 02 JSP'),
 (3, '2007-02-25 17:17:03.0', 'SO 02 JSP'),
 (18, '2007-02-25 17:10:43.0', 'SO 02 JSP'),
 (19, '2007-02-25 17:14:11.0', 'SO 02 JSP'),
 (10, '2007-02-25 18:23:11.0', 'SO 02 MUP'),
 (11, '2007-02-25 18:26:13.0', 'SO 02 NUP'),
 (12, '2007-02-25 18:29:01.0', 'SO 02 OUP'),
 (3, '2007-02-25 18:33:10.0', 'SO 02 PUP'),
 (3, '2007-02-25 18:39:10.0', 'SO 02 PUP'),
 (15, '2007-02-25 18:36:31.0', 'SO 02 PUP'),
 (9, '2007-02-25 16:39:10.0', 'SO 02 RSP'),
 (18, '2007-02-25 16:38:31.0', 'SO 02 RSP'),
 (9, '2007-02-25 16:31:01.0', 'SO 02 SSP'),
 (18, '2007-02-25 16:28:40.0', 'SO 02 SSP'),
 (2, '2007-02-25 07:20:01.0', 'SO 02 TSP'),
 (19, '2007-02-25 07:23:00.0', 'SO 02 TSP'),
 (19, '2007-02-25 07:26:31.0', 'SO 02 TSP'),
 (19, '2007-02-25 07:29:00.0', 'SO 02 TSP')]

## 4.
List the number of images taken by each camera. Your answer should show how many images have been taken by camera 1, camera 2 etc. The list must NOT include the images taken by camera 15, 16, 17, 18 and 19.

In [5]:
%%sql
SELECT CONCAT('Camera ', camera) camera, COUNT(*) n
  FROM image
    WHERE camera NOT BETWEEN 15 AND 19
    GROUP BY camera

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('Camera 1', 1),
 ('Camera 2', 1),
 ('Camera 3', 5),
 ('Camera 5', 1),
 ('Camera 8', 2),
 ('Camera 9', 8),
 ('Camera 10', 4),
 ('Camera 11', 3),
 ('Camera 12', 4)]

## 5.
A number of vehicles have permits that start on 30th Jan 2007. List the name and address for each keeper in alphabetical order without duplication.

In [6]:
%%sql
SELECT DISTINCT name, address
  FROM keeper JOIN vehicle ON (
      keeper.id=vehicle.keeper) JOIN
    permit ON (permit.reg=vehicle.id)
    WHERE TO_DATE(sdate)='2007-01-30'
    ORDER BY name

 * hive://cloudera@quickstart.cloudera:10000/sqlzoo
Done.

[('Ambiguous, Arthur', 'Absorption Ave.'),
 ('Assiduous, Annie', 'Attribution Alley'),
 ('Contiguous, Carol', 'Circumscription Close'),
 ('Strenuous, Sam', 'Surjection Street')]